import { PrismaClient, Prisma } from "../src/generated/prisma/client";
import { PrismaPg } from "@prisma/adapter-pg";
import "dotenv/config";

const adapter = new PrismaPg({
  connectionString: process.env.DATABASE_URL,
});

const prisma = new PrismaClient({
  adapter,
});

async function main() {
  // ===== SKILLS =====

  const skillData: Prisma.SkillCreateInput[] = [
    { name: "TypeScript", description: "", imagePath: "" },
    { name: "JavaScript", description: "", imagePath: "" },
    { name: "React", description: "", imagePath: "" },
    { name: "Next.js", description: "", imagePath: "" },
    { name: "Tailwind CSS", description: "", imagePath: "" },
    { name: "Ant Design", description: "", imagePath: "" },
    { name: "shadcn/ui", description: "", imagePath: "" },
    { name: "Express.js", description: "", imagePath: "" },
    { name: "NestJS", description: "", imagePath: "" },
    { name: "Microsoft SQL Server", description: "", imagePath: "" },
    { name: "PostgreSQL", description: "", imagePath: "" },
    { name: "Socket.IO", description: "", imagePath: "" },
    { name: "Docker", description: "", imagePath: "" },
    { name: "Git", description: "", imagePath: "" },
    { name: "PM2", description: "Node.js process manager", imagePath: "" },
    { name: "PDFKit", description: "Generate PDF on server", imagePath: "" },
    { name: "Prisma", description: "", imagePath: "" },
    { name: "Supabase", description: "", imagePath: "" },
  ];

  const skill = await Promise.all(
    skillData.map((i) =>
      prisma.skill.upsert({
        where: { name: i.name },
        update: {},
        create: {
          name: i.name,
          description: i.description,
          imagePath: i.imagePath,
        },
      }),
    ),
  );

  // ===== INTRODUCE =====
  const introduce = await prisma.introduceDetail.create({
    data: {
      title: "สวัสดีครับ",
      titleEmoji: "👋",
      detail: [
        "ผมเป็นนักพัฒนา Internal System มีประสบการณ์พัฒนา Web Applicatio สำหรับการใช้งานจริงในองค์กรกว่า 3 ปี มีส่วนร่วมตั้งแต่การเก็บความต้องการผู้ใช้งานการออกแบบโครงสร้างระบบและฐานข้อมูล",
        "รับผิดชอบการพัฒนา Backend และ RESTful API รวมถึง Frontend สำหรับระบบงานจริง มีความเข้าใจระบบ ERP ฝั่งการผลิตและการปฏิบัติงาน(ยกเว้นส่วนบัญชี)",
        "เข้าใจมุมมองการใช้งานจริงของผู้ใช้ และกระบวนการทำงานภายในองค์กร สามารถสื่อสารกับผู้ใช้งานและทีมงานได้อย่างมีประสิทธิภาพ",
      ],
    },
  });

  const personal = await prisma.personal.create({
    data: {
      firstname: "ธรรมรัตน์",
      lastname: "มนตรี",
      email: "tammarat.m123@gmail.com",
      idLine: "tammaratpleum99",
      gitLink: "https://github.com/Tamamrat0",
      phoneNumber: "0639414052",
      introduceId: introduce.id,
      skills: {
        create: skill.map((s) => ({
          skill: { connect: { id: s.id } },
        })),
      },
    },
  });

  await prisma.educationDetail.createMany({
    data: [
      {
        title: "ประกาศนียบัตรวิชาชีพ (ปวช.)",
        schoolName: "วิทยาลัยเทคนิคสมุทรสาคร",
        department: "สาขาคอมพิวเตอร์ธุรกิจ",
        startDate: new Date("2017-01-01"),
        endDate: new Date("2020-01-01"),
        detail: ["เกรดเฉลี่ย 3.40"],
        personalId: personal.id,
      },
      {
        title: "ประกาศนียบัตรวิชาชีพชั้นสูง (ปวส.)",
        schoolName: "วิทยาลัยฐานเทคโนโลยี",
        department: "สาขาธุรกิจดิจิทัล",
        startDate: new Date("2023-01-01"),
        endDate: new Date("2025-01-01"),
        detail: ["เกรดเฉลี่ย 3.30"],
        personalId: personal.id,
      },
    ],
  });

  const career = await prisma.career.create({
    data: {
      companyName: "Wann Cosmetics & Laboratory Co., Ltd",
      department: "IT Specialist (Internal System Developer)",
      startDate: new Date("2021-12-01"),
      experience: [
        "พัฒนา Web Application สำหรับใช้งานจริงภายในองค์กร เพื่อสนับสนุนการทำงานของหลายแผนก ครอบคลุมตั้งแต่การเก็บความต้องการผู้ใช้งาน การออกแบบระบบและฐานข้อมูล รวมถึงการจัดทำและจัดการฟอร์มเอกสารตามมาตรฐาน ISO และการพัฒนาเพื่อปรับปรุงระบบอย่างต่อเนื่อง",
        "ออกแบบและพัฒนา Backend และ RESTful API รวมถึง Frontend สำหรับระบบงานภายในองค์กร โดยคำนึงถึงความถูกต้องของข้อมูล ความปลอดภัย และการใช้งานจริงในสภาพแวดล้อมการทำงาน",
        "พัฒนาระบบเชื่อมต่อข้อมูลจากเครื่องชั่งน้ำหนักผ่าน Serial Communication (RS232 / RS485) เข้าสู่ Web Application เพื่อใช้งานในกระบวนการผลิตและการดำเนินงานภายในโรงงาน",
        "ทำงานร่วมกับทีมภายในและซัพพลายเออร์ในการพัฒนาระบบ โดยรับผิดชอบตั้งแต่การรวบรวม Requirement การวิเคราะห์กระบวนการ ออกแบบ Solution และทดสอบคุณภาพระบบ โดยเฉพาะระบบที่ต้องเชื่อมต่อกับ SAP Business One",
        "ดูแลและสนับสนุนการใช้งาน SAP Business One ในระดับผู้ใช้งาน วิเคราะห์ปัญหาที่เกิดขึ้น และประสานงานกับซัพพลายเออร์เพื่อแก้ไขปัญหาให้สอดคล้องกับกระบวนการทำงานขององค์กร",
        "ดูแลและบริหารโครงสร้างพื้นฐานด้าน IT ภายในองค์กรในส่วนที่จำเป็นต่อการทำงานของระบบ เช่น อุปกรณ์พื้นฐาน ระบบเครือข่าย และสภาพแวดล้อมที่เกี่ยวข้องกับการใช้งานระบบสารสนเทศ",
      ],
      achievements: [
        {
          imagePath: "/images/success_2024.jpg",
          detail: "ได้รับรางวัลพนังงานดีเด่นประจำปี 2024",
        },
      ],
      personalId: personal.id,
    },
  });

  const projectSkills = skill.filter((s) =>
    ["React", "JavaScript", "Express.js", "Microsoft SQL Server"].includes(
      s.name,
    ),
  );

  await prisma.projects.create({
    data: {
      name: "WannSystem v.1",
      description:
        "ระบบภายในองค์กรที่พัฒนาขึ้นแบบ End-to-End โดยรับผิดชอบการออกแบบและพัฒนาทั้งระบบเพียงผู้เดียว ครอบคลุมงานแจ้งซ่อม ข้อร้องเรียน และการสนับสนุนการทำงานของแผนกการตลาด เพื่อแก้ปัญหาการสื่อสารและการจัดการงานภายในองค์กรในระยะเริ่มต้น",
      techStack: {
        create: projectSkills.map((s) => ({
          skill: {
            connect: { id: s.id },
          },
        })),
      },
      overview: [
        "ระบบภายในองค์กรที่พัฒนาขึ้นแบบ End-to-End โดยรับผิดชอบการออกแบบและพัฒนาทั้งระบบเพียงผู้เดียว ครอบคลุมงานแจ้งซ่อม ข้อร้องเรียน และการสนับสนุนการทำงานของแผนกการตลาด เพื่อแก้ปัญหาการสื่อสารและการจัดการงานภายในองค์กรในระยะเริ่มต้น",
      ],
      role: [
        "เป็นผู้พัฒนาและดูแลระบบตั้งแต่ระยะเริ่มต้น (IT Management) และพัฒนาต่อยอด เป็น Wann System",
        "วิเคราะห์ workflow และความต้องการของผู้ใช้งานจากหลายแผนก",
        "ออกแบบโครงสร้างระบบและฐานข้อมูลให้รองรับการขยายตัวในอนาคต",
        "พัฒนา Backend, RESTful API และ Frontend สําหรับระบบภายในองค์กร",
        "ออกแบบและพัฒนาการเชื่อมต่อข้อมูลกับ SAP Business One ดูแลและปรับปรุงระบบจากการใช้งานจริงและ feedback ของผู้ใช้งาน",
      ],
      background: [
        "ก่อนพัฒนาระบบ องค์กรใช้เอกสารกระดาษเป็นหลักในการแจ้งซ่อมและแจ้งปัญหาภายใน โดยผู้ใช้งานต้องกรอกแบบฟอร์มและส่งให้แผนก IT ซึ่งก่อให้เกิดปัญหาเอกสารตกหล่น ข้อมูลไม่ครบถ้วนและยากต่อการติดตามสถานะงาน รวมถึงการจัดเก็บเอกสารที่ใช้พื้นที่และมีความซับซ้อนเพื่อแก้ไขปัญหาดังกล่าว จึงได้พัฒนาระบบ IT Management ขึ้นมา เพื่อให้ผู้ใช้งานสามารถแจ้งปัญหาและ ติดตามสถานะงานได้อย่างสะดวก และช่วยให้แผนก IT บริหารจัดการงานได้เป็นระบบ มากขึ้นหลังจากระบบเริ่มถูกใช้งานจริง ผู้บริหารเห็นถึงประโยชน์ของระบบ จึงให้ขยาย การใช้งานไปยังแผนก PE ซึ่งเป็นแผนกบริการภายในที่มีลักษณะการรับงานจาก เอกสารเช่นเดียวกัน",
        "ระบบถูกวางบทบาทให้เป็น Internal System สําหรับองค์กร และมีการ ขยายขอบเขตเพิ่มเติมเพื่อรองรับการทํางานของแผนก Marketing อย่างไรก็ตาม กระบวนการทํางานบางส่วน โดยเฉพาะในช่วงก่อนการเกิดคําสั่งชื้อหรือ สัญญา ยังไม่สามารถบันทึกข้อมูลลูกค้าใน SAP Business One ได้ตามเงื่อนไขของ ระบบส่งผลให้แผนก Marketing ไม่สามารถจัดการลูกค้าใหม่ได้อย่างเป็นระบบ รวมถึงการทําใบเสนอราคาและการส่งตัวอย่างสินค้าที่ขาดการติดตามสถานะอย่างชัดเจนจึงเกิดแนวคิดในการพัฒนาระบบเสริม เพื่อรองรับกระบวนการทํางานก่อนการขาย และเชื่อมต่อข้อมูลเข้าสู่ SAP เมื่อถึงขั้นตอนที่เหมาะสม โดยยังคงกําหนดให้ SAP เป็นระบบหลักขององค์กร",
        "นอกจากนี้ ยังมีอีกหลายกระบวนการทํางานภายในองค์กรที่ระบบ SAP Business One ยังไม่สามารถตอบโจทย์ได้อย่างครบถ้วนจึงมีการวางแนวทางในการพัฒนา Wann System ให้เป็นระบบเสริม เพื่อรองรับการ ทํางานของแผนกอื่นเพิ่มเติม เช่น ระบบคลังสินค้าสําหรับการตัดจ่ายวัสดุผ่าน ORCode และระบบ Dashboard สําหรับติดตามสถานะการผลิต โดยยังคงกําหนดให้ SAP เป็นระบบหลักขององค์กร และใช้ Wann System ในการเติมเต็ม workflow ที่ SAP ไม่ครอบคลุม",
      ],
      problem: [
        "ในช่วงแรก มีการออกแบบ UX/UI จากมุมมองของผู้พัฒนาเป็นหลัก โดยคาดหวัง ให้ระบบเข้ามาเปลี่ยนรูปแบบการทํางานเดิมทั้งหมด ส่งผลให้ผู้ใช้งานบางส่วนปรับตัวได้ไม่ทัน",
        "การออกแบบระบบที่ต้องทํางานร่วมกับ SAP Business One ซึ่งมีข้อจํากัดด้านการ เชื่อมต่อข้อมูล โดยสามารถดึงข้อมูลจาก SAP ได้ แต่ไม่สามารถเขียนข้อมูลกลับ เข้าไปได้ ทําให้บางกระบวนการจําเป็นต้องมีการกรอกข้อมูลซ้ําหรือใช้ขั้นตอนอ้อม",
        "การพัฒนาระบบโดยทํางานเพียงคนเดียวส่งผลให้ส่งมอบงานช้าในบางส่วน",
      ],
      solution: [
        "ปรับแนวทางการออกแบบ UX/UI โดยเริ่มจากการทําความเข้าใจพฤติกรรมผู้ใช้งานจริง และ ค่อย ๆ ปรับระบบให้ใกล้เคียงรูปแบบการทํางานเดิม เพื่อให้ผู้ใช้งานสามารถปรับตัวได้ง่ายขึ้น ออกแบบระบบให้ทํางานร่วมกับ SAP Business One ภายใต้ข้อจํากัดของการเชื่อมต่อ โดย กําหนดขอบเขตข้อมูลให้ชัดเจน และยอมรับขั้นตอนบางส่วนที่ต้องกรอกข้อมูลซ้ํา เพื่อรักษาความถูกต้องของข้อมูลหลักใน SAP จัดลําดับความสําคัญของฟีเจอร์ และแบ่งการพัฒนาเป็นระยะ เพื่อให้สามารถส่งมอบระบบบางส่วนไปใช้งานได้ก่อน",
      ],
      attachments: [
        {
          imagePath: "/images/success_2024.jpg",
          detail: "ภาพหน้า Dashboard",
        },
      ],
      link: "https://portfolio.example.com",

      personalId: personal.id,
      careerId: career.id,
    },
    //   {
    //     name: "WannSystem v.2",
    //     description:
    //       "พัฒนาต่อยอดจาก WannSystem v.1 โดยออกแบบใหม่เพื่อรองรับการใช้งานในระดับ Internal System อย่างเต็มรูปแบบ ทำงานร่วมกับทีม Backend โดยรับผิดชอบฝั่ง Frontend ทั้งหมด เน้นการปรับปรุงโครงสร้างระบบ การจัดการสิทธิ์ผู้ใช้งานแบบละเอียด (User Permission) การตั้งค่าการแจ้งเตือนแบบกำหนดผู้ส่ง–ผู้รับ การแจ้งเตือนแบบ Real-time และการจัดเก็บ Log ที่มีรายละเอียดมากขึ้น เพื่อเพิ่มความยืดหยุ่น ความปลอดภัย และการตรวจสอบย้อนหลังของระบบ",
    //     techStack: {
    //       create: skill.map((s) => ({
    //         skill: { connect: { id: s.id } },
    //       })),
    //     },
    //     overview: [
    //       "ระบบภายในองค์กรที่พัฒนาขึ้นแบบ End-to-End โดยรับผิดชอบการออกแบบและพัฒนาทั้งระบบเพียงผู้เดียว ครอบคลุมงานแจ้งซ่อม ข้อร้องเรียน และการสนับสนุนการทำงานของแผนกการตลาด เพื่อแก้ปัญหาการสื่อสารและการจัดการงานภายในองค์กรในระยะเริ่มต้น",
    //     ],
    //     role: [""],
    //     background: [""],
    //     problem: [""],
    //     solution: [""],
    //     attachments: [],
    //     link: "",

    //     personalId: personal.id,
    //     careerId: career.id,
    //   },
  });
}

main()
  .catch((e) => {
    console.error(e);
    process.exit(1);
  })
  .finally(async () => {
    await prisma.$disconnect();
  });
