import { CareerItem } from "@/app/types/career-type";

export const CareerData: CareerItem[] = [
  {
    id: "1",
    companyName: "Wann Cosmetics & Laboratory Co., Ltd",
    companyLogo: "/images/logo-wann.svg",
    position: "IT Specialist (Internal System Developer)",
    period: { start: "Dec 2021", end: "Present" },
    jobExperience: [
      "พัฒนา Web Application สำหรับใช้งานจริงภายในองค์กร เพื่อสนับสนุนการทำงานของหลายแผนก ครอบคลุมตั้งแต่การเก็บความต้องการผู้ใช้งาน การออกแบบระบบและฐานข้อมูล รวมถึงการจัดทำและจัดการฟอร์มเอกสารตามมาตรฐาน ISO และการพัฒนาเพื่อปรับปรุงระบบอย่างต่อเนื่อง",
      "ออกแบบและพัฒนา Backend และ RESTful API รวมถึง Frontend สำหรับระบบงานภายในองค์กร โดยคำนึงถึงความถูกต้องของข้อมูล ความปลอดภัย และการใช้งานจริงในสภาพแวดล้อมการทำงาน",
      "พัฒนาระบบเชื่อมต่อข้อมูลจากเครื่องชั่งน้ำหนักผ่าน Serial Communication (RS232 / RS485) เข้าสู่ Web Application เพื่อใช้งานในกระบวนการผลิตและการดำเนินงานภายในโรงงาน",
      "ทำงานร่วมกับทีมภายในและซัพพลายเออร์ในการพัฒนาระบบ โดยรับผิดชอบตั้งแต่การรวบรวม Requirement การวิเคราะห์กระบวนการ ออกแบบ Solution และทดสอบคุณภาพระบบ โดยเฉพาะระบบที่ต้องเชื่อมต่อกับ SAP Business One",
      "ดูแลและสนับสนุนการใช้งาน SAP Business One ในระดับผู้ใช้งาน วิเคราะห์ปัญหาที่เกิดขึ้น และประสานงานกับซัพพลายเออร์เพื่อแก้ไขปัญหาให้สอดคล้องกับกระบวนการทำงานขององค์กร",
      "ดูแลและบริหารโครงสร้างพื้นฐานด้าน IT ภายในองค์กรในส่วนที่จำเป็นต่อการทำงานของระบบ เช่น อุปกรณ์พื้นฐาน ระบบเครือข่าย และสภาพแวดล้อมที่เกี่ยวข้องกับการใช้งานระบบสารสนเทศ",
    ],
    jobSuccess: [
      {
        id: "1",
        imagePath: "/images/success_2024.jpg",
        detail: "ได้รับรางวัลพนังงานดีเด่นประจำปี 2024",
      },
    ],
    projects: ["1", "2", "3"],
  },
];
