import { ProjectItem } from "@/app/types/project-type";

export const ProjectData: ProjectItem[] = [
  {
    id: "1",
    name: "WannSystem v.1",
    description:
      "ระบบภายในองค์กรที่พัฒนาขึ้นแบบ End-to-End โดยรับผิดชอบการออกแบบและพัฒนาทั้งระบบเพียงผู้เดียว ครอบคลุมงานแจ้งซ่อม ข้อร้องเรียน และการสนับสนุนการทำงานของแผนกการตลาด เพื่อแก้ปัญหาการสื่อสารและการจัดการงานภายในองค์กรในระยะเริ่มต้น",
    techStack: ["React", "Tailwind", "Antd", "ExpressJS", "SocketIo", "Mssql"],
    overview: [
      "ระบบภายในองค์กรที่พัฒนาขึ้นแบบ End-to-End โดยรับผิดชอบการออกแบบและพัฒนาทั้งระบบเพียงผู้เดียว ครอบคลุมงานแจ้งซ่อม ข้อร้องเรียน และการสนับสนุนการทำงานของแผนกการตลาด เพื่อแก้ปัญหาการสื่อสารและการจัดการงานภายในองค์กรในระยะเริ่มต้น",
    ],
    role: [
      "เป็นผู้พัฒนาและดูแลระบบตั้งแต่ระยะเริ่มต้น (IT Management) และพัฒนาต่อยอด เป็น Wann System",
      "วิเคราะห์ workflow และความต้องการของผู้ใช้งานจากหลายแผนก",
      "ออกแบบโครงสร้างระบบและฐานข้อมูลให้รองรับการขยายตัวในอนาคต",
      "พัฒนา Backend, RESTful API และ Frontend สําหรับระบบภายในองค์กร",
      "ออกแบบและพัฒนาการเชื่อมต่อข้อมูลกับ SAP Business One ดูแลและปรับปรุงระบบจากการใช้งานจริงและ feedback ของผู้ใช้งาน",
    ],
    background: [
      "ก่อนพัฒนาระบบ องค์กรใช้เอกสารกระดาษเป็นหลักในการแจ้งซ่อมและแจ้งปัญหาภายใน โดยผู้ใช้งานต้องกรอกแบบฟอร์มและส่งให้แผนก IT ซึ่งก่อให้เกิดปัญหาเอกสารตกหล่น ข้อมูลไม่ครบถ้วนและยากต่อการติดตามสถานะงาน รวมถึงการจัดเก็บเอกสารที่ใช้พื้นที่และมีความซับซ้อนเพื่อแก้ไขปัญหาดังกล่าว จึงได้พัฒนาระบบ IT Management ขึ้นมา เพื่อให้ผู้ใช้งานสามารถแจ้งปัญหาและ ติดตามสถานะงานได้อย่างสะดวก และช่วยให้แผนก IT บริหารจัดการงานได้เป็นระบบ มากขึ้นหลังจากระบบเริ่มถูกใช้งานจริง ผู้บริหารเห็นถึงประโยชน์ของระบบ จึงให้ขยาย การใช้งานไปยังแผนก PE ซึ่งเป็นแผนกบริการภายในที่มีลักษณะการรับงานจาก เอกสารเช่นเดียวกัน",
      "ระบบถูกวางบทบาทให้เป็น Internal System สําหรับองค์กร และมีการ ขยายขอบเขตเพิ่มเติมเพื่อรองรับการทํางานของแผนก Marketing อย่างไรก็ตาม กระบวนการทํางานบางส่วน โดยเฉพาะในช่วงก่อนการเกิดคําสั่งชื้อหรือ สัญญา ยังไม่สามารถบันทึกข้อมูลลูกค้าใน SAP Business One ได้ตามเงื่อนไขของ ระบบส่งผลให้แผนก Marketing ไม่สามารถจัดการลูกค้าใหม่ได้อย่างเป็นระบบ รวมถึงการทําใบเสนอราคาและการส่งตัวอย่างสินค้าที่ขาดการติดตามสถานะอย่างชัดเจนจึงเกิดแนวคิดในการพัฒนาระบบเสริม เพื่อรองรับกระบวนการทํางานก่อนการขาย และเชื่อมต่อข้อมูลเข้าสู่ SAP เมื่อถึงขั้นตอนที่เหมาะสม โดยยังคงกําหนดให้ SAP เป็นระบบหลักขององค์กร",
      "นอกจากนี้ ยังมีอีกหลายกระบวนการทํางานภายในองค์กรที่ระบบ SAP Business One ยังไม่สามารถตอบโจทย์ได้อย่างครบถ้วนจึงมีการวางแนวทางในการพัฒนา Wann System ให้เป็นระบบเสริม เพื่อรองรับการ ทํางานของแผนกอื่นเพิ่มเติม เช่น ระบบคลังสินค้าสําหรับการตัดจ่ายวัสดุผ่าน ORCode และระบบ Dashboard สําหรับติดตามสถานะการผลิต โดยยังคงกําหนดให้ SAP เป็นระบบหลักขององค์กร และใช้ Wann System ในการเติมเต็ม workflow ที่ SAP ไม่ครอบคลุม",
    ],
    problem: [
      "ในช่วงแรก มีการออกแบบ UX/UI จากมุมมองของผู้พัฒนาเป็นหลัก โดยคาดหวัง ให้ระบบเข้ามาเปลี่ยนรูปแบบการทํางานเดิมทั้งหมด ส่งผลให้ผู้ใช้งานบางส่วนปรับตัวได้ไม่ทัน",
      "การออกแบบระบบที่ต้องทํางานร่วมกับ SAP Business One ซึ่งมีข้อจํากัดด้านการ เชื่อมต่อข้อมูล โดยสามารถดึงข้อมูลจาก SAP ได้ แต่ไม่สามารถเขียนข้อมูลกลับ เข้าไปได้ ทําให้บางกระบวนการจําเป็นต้องมีการกรอกข้อมูลซ้ําหรือใช้ขั้นตอนอ้อม",
      "การพัฒนาระบบโดยทํางานเพียงคนเดียวส่งผลให้ส่งมอบงานช้าในบางส่วน",
    ],
    solve: [
      "ปรับแนวทางการออกแบบ UX/UI โดยเริ่มจากการทําความเข้าใจพฤติกรรมผู้ใช้งานจริง และ ค่อย ๆ ปรับระบบให้ใกล้เคียงรูปแบบการทํางานเดิม เพื่อให้ผู้ใช้งานสามารถปรับตัวได้ง่ายขึ้น ออกแบบระบบให้ทํางานร่วมกับ SAP Business One ภายใต้ข้อจํากัดของการเชื่อมต่อ โดย กําหนดขอบเขตข้อมูลให้ชัดเจน และยอมรับขั้นตอนบางส่วนที่ต้องกรอกข้อมูลซ้ํา เพื่อรักษาความถูกต้องของข้อมูลหลักใน SAP จัดลําดับความสําคัญของฟีเจอร์ และแบ่งการพัฒนาเป็นระยะ เพื่อให้สามารถส่งมอบระบบบางส่วนไปใช้งานได้ก่อน",
    ],
    link: "",
    attachments: [
      {
        imagePath: "/images/success_2024.jpg",
        detail: "ได้รับรางวัลพนังงานดีเด่นประจำปี 2024",
      },
    ],
  },
  {
    id: "2",
    name: "WannSystem v.2",
    description:
      "พัฒนาต่อยอดจาก WannSystem v.1 โดยออกแบบใหม่เพื่อรองรับการใช้งานในระดับ Internal System อย่างเต็มรูปแบบ ทำงานร่วมกับทีม Backend โดยรับผิดชอบฝั่ง Frontend ทั้งหมด เน้นการปรับปรุงโครงสร้างระบบ การจัดการสิทธิ์ผู้ใช้งานแบบละเอียด (User Permission) การตั้งค่าการแจ้งเตือนแบบกำหนดผู้ส่ง–ผู้รับ การแจ้งเตือนแบบ Real-time และการจัดเก็บ Log ที่มีรายละเอียดมากขึ้น เพื่อเพิ่มความยืดหยุ่น ความปลอดภัย และการตรวจสอบย้อนหลังของระบบ",
    techStack: ["NextJS", "Tailwind", "Shadcn", "NestJS", "Mssql"],
    overview: [""],
    role: [""],
    background: [""],
    problem: [""],
    link: "",
    attachments: [{ imagePath: "", detail: "" }],
  },
  {
    id: "3",
    name: "WannSmart",
    description:
      "ระบบเสริมเพื่อเติมเต็มความสามารถที่ SAP Business One ยังไม่ครอบคลุม โดยรับบทบาทเป็นผู้ประสานงานและควบคุมโครงการ (Project Coordinator / PM) ตั้งแต่การเก็บ Requirement สรุปความต้องการผู้ใช้ ประสานงานกับทีมพัฒนาภายนอก ติดตามความคืบหน้า จัดประชุมประจำสัปดาห์ และรวบรวม Feedback จากผู้ใช้งานเพื่อนำไปปรับปรุงระบบ",
    techStack: [],
    overview: [""],
    role: [""],
    background: [""],
    problem: [""],
    link: "",
    attachments: [{ imagePath: "", detail: "" }],
  },
];
